* No derailment (Move between segments)
** Elapsed time
|-----------------+-----------+-----------+-----------+-----------|
| Configuration   |     First |    Second |     Third |   Average |
|-----------------+-----------+-----------+-----------+-----------|
| Station One     |     0.028 |     0.038 |     0.039 |     0.035 |
| Station Two     |     0.777 |     0.927 |     0.906 |      0.87 |
| Station Four    |    32.451 |    36.382 |    33.524 |    34.119 |
| Station Six     |   910.817 |   888.077 |   888.182 |   895.692 |
| Station Eight   |  6530.169 |  6563.059 |  6564.713 |  6552.647 |
| Nærumbanen (2T) |   242.522 |   242.283 |   242.911 |   242.572 |
| Nærumbanen (3T) | 10033.654 | 10092.504 | 10099.487 | 10075.215 |
|-----------------+-----------+-----------+-----------+-----------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-----------------+----------+----------+----------+-----------|
| Configuration   |    First |   Second |    Third |   Average |
|-----------------+----------+----------+----------+-----------|
| Station One     |   12.036 |   12.060 |   12.068 | 12.054667 |
| Station Two     |   18.520 |   18.568 |   18.576 | 18.554667 |
| Station Four    |  139.412 |  139.664 |  139.672 | 139.58267 |
| Station Six     |  680.148 |  680.496 |  680.504 | 680.38267 |
| Station Eight   | 2103.844 | 2104.664 | 2103.808 | 2104.1053 |
| Nærumbanen (2T) |  240.248 |  240.920 |  240.948 | 240.70533 |
| Nærumbanen (3T) | 3640.400 | 3640.416 | 3640.424 | 3640.4133 |
|-----------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Critical section)
** Elapsed time
|-----------------+-----------+-----------+----------+------------|
| Configuration   |     First |    Second |    Third |    Average |
|-----------------+-----------+-----------+----------+------------|
| Station One     |     0.038 |     0.035 |    0.035 |      0.036 |
| Station Two     |     0.913 |     0.926 |    0.793 | 0.87733333 |
| Station Four    |    32.448 |    32.247 |   32.239 |  32.311333 |
| Station Six     |   920.258 |   917.515 |  922.833 |    920.202 |
| Station Eight   |  6620.755 |  6610.525 | 6595.127 |  6608.8023 |
| Nærumbanen (2T) |   249.023 |   253.583 |  252.875 |    251.827 |
| Nærumbanen (3T) | 10004.897 | 10072.137 | 9968.254 |  10015.096 |
|-----------------+-----------+-----------+----------+------------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-----------------+----------+----------+----------+-----------|
| Configuration   |    First |   Second |    Third |   Average |
|-----------------+----------+----------+----------+-----------|
| Station One     |    8.716 |    8.736 |    8.744 |     8.732 |
| Station Two     |   16.624 |   16.680 |   16.680 | 16.661333 |
| Station Four    |  139.368 |  139.620 |  139.628 | 139.53867 |
| Station Six     |  680.044 |  680.392 |  680.392 |   680.276 |
| Station Eight   | 2103.808 | 2104.628 | 2104.632 |  2104.356 |
| Nærumbanen (2T) |  238.396 |  239.228 |  239.252 | 238.95867 |
| Nærumbanen (3T) | 3638.684 | 3638.700 | 3638.712 | 3638.6987 |
|-----------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
|-----------------+----------+----------+----------+-----------|
| Configuration   |    First |   Second |    Third | Average   |
|-----------------+----------+----------+----------+-----------|
| Station One     |    0.048 |    0.044 |    0.047 | vmean([]) |
| Station Two     |    0.915 |    0.932 |    0.835 | vmean([]) |
| Station Four    |   33.160 |   32.814 |   35.634 | vmean([]) |
| Station Six     |  946.866 |  952.055 |  954.846 | vmean([]) |
| Station Eight   | 6550.005 | 6608.182 | 6603.568 | vmean([]) |
| Nærumbanen (2T) |  254.086 |  251.442 |  250.039 | vmean([]) |
| Nærumbanen (3T) | 9754.725 |          |          |           |
|-----------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|-----------------+----------+----------+----------+-----------|
| Configuration   |    First |   Second |    Third | Average   |
|-----------------+----------+----------+----------+-----------|
| Station One     |    8.708 |    8.732 |    8.740 | vmean([]) |
| Station Two     |   16.604 |   16.656 |   16.664 | vmean([]) |
| Station Four    |  139.356 |  139.608 |  139.616 | vmean([]) |
| Station Six     |  680.100 |  680.448 |  680.452 | vmean([]) |
| Station Eight   | 2103.804 | 2104.608 | 2104.624 | vmean([]) |
| Nærumbanen (2T) |  238.384 |  239.212 |  239.240 | vmean([]) |
| Nærumbanen (3T) | 3638.672 |          |          |           |
|-----------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third | Average   |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |          |          |          | vmean([]) |
| Example with two trains    |          |          |          | vmean([]) |
| Shared Segment             |          |          |          | vmean([]) |
| Large Network              |          |          |          | vmean([]) |
| Station One                |    0.025 |    0.025 |    0.030 | vmean([]) |
| Station Two                |    0.887 |    0.781 |    0.777 | vmean([]) |
| Station Four               |   36.392 |   31.455 |   36.080 | vmean([]) |
| Station Six                |  938.160 |  932.271 |  931.334 | vmean([]) |
| Station Eight              | 6647.814 | 6618.742 | 6608.544 | vmean([]) |
| Station Ten                |          |          |          | vmean([]) |
| Station Twelfth            |          |          |          | vmean([]) |
| Two trains same direction  |          |          |          | vmean([]) |
| Four trains same direction |          |          |          | vmean([]) |
| Nærumbanen (2T)            |  245.720 |  241.710 |  241.961 | vmean([]) |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+----------+----------+----------+-----------|
| Configuration              |    First |   Second |    Third | Average   |
|----------------------------+----------+----------+----------+-----------|
| Example with one train     |          |          |          | vmean([]) |
| Example with two trains    |          |          |          | vmean([]) |
| Shared Segment             |          |          |          | vmean([]) |
| Large Network              |          |          |          | vmean([]) |
| Station One                |    8.624 |    8.636 |    8.640 | vmean([]) |
| Station Two                |   16.472 |   16.512 |   16.516 | vmean([]) |
| Station Four               |  138.064 |  138.196 |  138.212 | vmean([]) |
| Station Six                |  675.176 |  675.516 |  675.516 | vmean([]) |
| Station Eight              | 2087.188 | 2087.984 | 2087.984 | vmean([]) |
| Station Ten                |          |          |          | vmean([]) |
| Station Twelfth            |          |          |          | vmean([]) |
| Two trains same direction  |          |          |          | vmean([]) |
| Four trains same direction |          |          |          | vmean([]) |
| Nærumbanen (2T)            |  238.316 |  239.136 |  239.156 | vmean([]) |
|----------------------------+----------+----------+----------+-----------|
#+TBLFM: $5=vmean($2..$4)
